import pytest

@pytest.fixture(scope="session")
def valid_phones() -> list[str]:
    """набор синтаксически корректных номеров телефонов"""
    return [
        "+79063689927",
        "+79000000000",
        "+79738478934",
        "+79999999999",
        "+79111111111",
        "+79549249430"
    ]
@pytest.fixture(scope="session")
def invalid_phones()->list[str]:
    """набор некорректных номеров телефонов"""
    return [
        "", # пустая строка
        "790536477389", # нет +
        "+89000000000", # неправильный код после +
        "+78888888888", # неправильный код
        "+79hjg777879", # буквы вместо цифр
        "+79787", # слишком короткий
        "+79000000000000", # слишком длинный
        "+79 000000000", # пробелы внутри номера
        "+79-000-000-00-00", # дефисы внутри номера
        " +79000000000", # пробел в начале номера
        "+79000000000 " # пробел в конце номера
    ]